index.org
#+TITLE:     Plan For Gene
#+AUTHOR:    mingzailao
#+EMAIL:     mingzailao@126.com
#+DATE:      <2017-07-04 Tue>
#+TAGS:      Work
#+LAYOUT:    
#+CATEGORIES: 


* DONE Read the Dataset
  CLOSED: [2017-06-30 Fri 21:20]

Read the dataset, read the dataset as the dataframe in pandas.

** DONE deal with the file (target file)
   CLOSED: [2017-07-04 Tue 15:56]
** DONE Deal with the gene data (ctla4 people)
   CLOSED: [2017-07-04 Tue 15:59]
   - duplicate the colomns
   - delete the gene data which with no target
   - add the target information to the gene data
   - delete the gene data which is all NaN
   - count zeros
   - delete the no information target instance
   - Long survival as yes
   CLOSED: [2017-07-04 Tue 15:56]
** DONE Deal with the gene data (pd1 people)
   CLOSED: [2017-07-04 Tue 15:59]
   - duplicate the colomns
   - delete the gene data which with no target
   - add the target information to the gene data
   - delete the gene data which is all NaN
   - count zeros
   - delete the no information target instance
   - Long survival as yes
** DONE save data
   CLOSED: [2017-07-04 Tue 15:56]
* DONE Feature selection(reducing the dimension)
  CLOSED: [2017-07-04 Tue 19:00]
** DONE t检验
   CLOSED: [2017-07-04 Tue 19:34]
** TODO Model based method
**** DONE Random Forest
     CLOSED: [2017-07-04 Tue 15:56]
**** DONE Linear SVM
     CLOSED: [2017-07-04 Tue 15:57]
**** TODO Sparse PCA
** TODO Repeat the experiment to build the gene pool
** TODO workflow
 1. Use t-test to select the gene features.
 2. Scaling the  dataset. 
 3. After 1) step, build a model A1  to test the classifier's performance.
 4. After t-test, use the model based method to select less features.
 5. After 3) step, build a model A2 with the same parameters and test the classifier's performance again.
 6. If A2 has better performance than A1, then we can think that the features we picked is good than A1.
 7. Repeat the 3-5) step. 
* TODO Select the feature to clustering 
** TODO Use the feature selected to do the clustering work
*** TODO Kmeans for clustering
**** 4 clusters
     - positive instance that use ctla4.
     - negtive instance that use ctla4.
     - positive instance that use pd1.
     - negtive instance that use pd1.

*** TODO Spectral Clustering
