index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-07-04 Tue 19:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Plan For Gene</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="mingzailao" />
</head>
<body>
<div id="content">
<h1 class="title">Plan For Gene</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org63a91aa">1. <span class="done DONE">DONE</span> Read the Dataset</a>
<ul>
<li><a href="#org0f25347">1.1. <span class="done DONE">DONE</span> deal with the file (target file)</a></li>
<li><a href="#orga4b2670">1.2. <span class="done DONE">DONE</span> Deal with the gene data (ctla4 people)</a></li>
<li><a href="#org8aa5cc8">1.3. <span class="done DONE">DONE</span> Deal with the gene data (pd1 people)</a></li>
<li><a href="#org2d83f74">1.4. <span class="done DONE">DONE</span> save data</a></li>
</ul>
</li>
<li><a href="#org27e16e1">2. <span class="done DONE">DONE</span> Feature selection(reducing the dimension)</a>
<ul>
<li><a href="#org72d2873">2.1. <span class="done DONE">DONE</span> t检验</a></li>
<li><a href="#org216e996">2.2. <span class="todo TODO">TODO</span> Model based method</a></li>
<li><a href="#org47cc1e8">2.3. <span class="todo TODO">TODO</span> Repeat the experiment to build the gene pool</a></li>
<li><a href="#orgda93fe3">2.4. <span class="todo TODO">TODO</span> workflow</a></li>
</ul>
</li>
<li><a href="#org4e67507">3. <span class="todo TODO">TODO</span> Select the feature to clustering</a>
<ul>
<li><a href="#org2ffafca">3.1. Use the feature selected to do the clustering work</a>
<ul>
<li><a href="#orga3467cb">3.1.1. Kmeans for clustering</a></li>
<li><a href="#orge6d08df">3.1.2. Spectral Clustering</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org63a91aa" class="outline-2">
<h2 id="org63a91aa"><span class="section-number-2">1</span> <span class="done DONE">DONE</span> Read the Dataset</h2>
<div class="outline-text-2" id="text-1">
<p>
Read the dataset, read the dataset as the dataframe in pandas.
</p>
</div>

<div id="outline-container-org0f25347" class="outline-3">
<h3 id="org0f25347"><span class="section-number-3">1.1</span> <span class="done DONE">DONE</span> deal with the file (target file)</h3>
<div class="outline-text-3" id="text-1-1">
</div>
</div>
<div id="outline-container-orga4b2670" class="outline-3">
<h3 id="orga4b2670"><span class="section-number-3">1.2</span> <span class="done DONE">DONE</span> Deal with the gene data (ctla4 people)</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>duplicate the colomns</li>
<li>delete the gene data which with no target</li>
<li>add the target information to the gene data</li>
<li>delete the gene data which is all NaN</li>
<li>count zeros</li>
<li>delete the no information target instance</li>
<li>Long survival as yes</li>
</ul>
<p>
CLOSED: <span class="timestamp-wrapper"><span class="timestamp">[2017-07-04 Tue 15:56]</span></span>
</p>
</div>
</div>
<div id="outline-container-org8aa5cc8" class="outline-3">
<h3 id="org8aa5cc8"><span class="section-number-3">1.3</span> <span class="done DONE">DONE</span> Deal with the gene data (pd1 people)</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>duplicate the colomns</li>
<li>delete the gene data which with no target</li>
<li>add the target information to the gene data</li>
<li>delete the gene data which is all NaN</li>
<li>count zeros</li>
<li>delete the no information target instance</li>
<li>Long survival as yes</li>
</ul>
</div>
</div>
<div id="outline-container-org2d83f74" class="outline-3">
<h3 id="org2d83f74"><span class="section-number-3">1.4</span> <span class="done DONE">DONE</span> save data</h3>
<div class="outline-text-3" id="text-1-4">
</div>
</div>
</div>
<div id="outline-container-org27e16e1" class="outline-2">
<h2 id="org27e16e1"><span class="section-number-2">2</span> <span class="done DONE">DONE</span> Feature selection(reducing the dimension)</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org72d2873" class="outline-3">
<h3 id="org72d2873"><span class="section-number-3">2.1</span> <span class="done DONE">DONE</span> t检验</h3>
<div class="outline-text-3" id="text-2-1">
</div>
</div>
<div id="outline-container-org216e996" class="outline-3">
<h3 id="org216e996"><span class="section-number-3">2.2</span> <span class="todo TODO">TODO</span> Model based method</h3>
<div class="outline-text-3" id="text-2-2">
</div><ol class="org-ol"><li><a id="orge61ebf3"></a><span class="done DONE">DONE</span> Random Forest<br  /><div class="outline-text-5" id="text-2-2-0-1">
</div></li>
<li><a id="org2f3afac"></a><span class="done DONE">DONE</span> Linear SVM<br  /><div class="outline-text-5" id="text-2-2-0-2">
</div></li>
<li><a id="org58aa5df"></a><span class="todo TODO">TODO</span> Sparse PCA<br  /></li></ol>
</div>
<div id="outline-container-org47cc1e8" class="outline-3">
<h3 id="org47cc1e8"><span class="section-number-3">2.3</span> <span class="todo TODO">TODO</span> Repeat the experiment to build the gene pool</h3>
</div>
<div id="outline-container-orgda93fe3" class="outline-3">
<h3 id="orgda93fe3"><span class="section-number-3">2.4</span> <span class="todo TODO">TODO</span> workflow</h3>
<div class="outline-text-3" id="text-2-4">
<ol class="org-ol">
<li>Use t-test to select the gene features.</li>
<li>Scaling the  dataset.</li>
<li>After 1) step, build a model A1  to test the classifier's performance.</li>
<li>After t-test, use the model based method to select less features.</li>
<li>After 3) step, build a model A2 with the same parameters and test the classifier's performance again.</li>
<li>If A2 has better performance than A1, then we can think that the features we picked is good than A1.</li>
<li>Repeat the 3-5) step.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org4e67507" class="outline-2">
<h2 id="org4e67507"><span class="section-number-2">3</span> <span class="todo TODO">TODO</span> Select the feature to clustering</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-org2ffafca" class="outline-3">
<h3 id="org2ffafca"><span class="section-number-3">3.1</span> Use the feature selected to do the clustering work</h3>
<div class="outline-text-3" id="text-3-1">
</div><div id="outline-container-orga3467cb" class="outline-4">
<h4 id="orga3467cb"><span class="section-number-4">3.1.1</span> Kmeans for clustering</h4>
<div class="outline-text-4" id="text-3-1-1">
</div><ol class="org-ol"><li><a id="orgdc3554a"></a>4 clusters<br  /><div class="outline-text-5" id="text-3-1-1-1">
<ul class="org-ul">
<li>positive instance that use ctla4.</li>
<li>negtive instance that use ctla4.</li>
<li>positive instance that use pd1.</li>
<li>negtive instance that use pd1.</li>
</ul>
</div></li></ol>
</div>

<div id="outline-container-orge6d08df" class="outline-4">
<h4 id="orge6d08df"><span class="section-number-4">3.1.2</span> Spectral Clustering</h4>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2017-07-04 Tue 00:00</p>
<p class="author">Author: mingzailao</p>
<p class="date">Created: 2017-07-04 Tue 19:35</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
